hjgqx996/GdkyWork/GSWCJ2019/sources/bsp/msp430x44x/io430f448.h
/********************************************************************
 *
 * Standard register and bit definitions for the Texas Instruments
 * MSP430 microcontroller.
 *
 * This file supports assembler and C/EC++ development for
 * msp430f448 devices.
 *
 * Copyright 1996-2016 IAR Systems AB.
 *
 *
 *
 ********************************************************************/

#ifndef __IO430F448
#define __IO430F448

#ifdef  __IAR_SYSTEMS_ICC__

#include "intrinsics.h"
#ifndef _SYSTEM_BUILD
#pragma system_include
#endif
#endif

#if (((__TID__ >> 8) & 0x7F) != 0x2b)     /* 0x2b = 43 dec */
#error io430f448.h file for use with ICC430/A430 only
#endif


#ifdef __IAR_SYSTEMS_ICC__
#pragma language=save
#pragma language=extended


#ifdef __cplusplus
#define __READ    /* not supported */
#else
#define __READ    const
#endif


/*-------------------------------------------------------------------------
 *   Standard Bits
 *-------------------------------------------------------------------------*/

#define BIT0                (0x0001)
#define BIT1                (0x0002)
#define BIT2                (0x0004)
#define BIT3                (0x0008)
#define BIT4                (0x0010)
#define BIT5                (0x0020)
#define BIT6                (0x0040)
#define BIT7                (0x0080)
#define BIT8                (0x0100)
#define BIT9                (0x0200)
#define BITA                (0x0400)
#define BITB                (0x0800)
#define BITC                (0x1000)
#define BITD                (0x2000)
#define BITE                (0x4000)
#define BITF                (0x8000)

/*-------------------------------------------------------------------------
 *   Status register bits
 *-------------------------------------------------------------------------*/

#define C                   (0x0001)
#define Z                   (0x0002)
#define N                   (0x0004)
#define V                   (0x0100)
#define GIE                 (0x0008)
#define CPUOFF              (0x0010)
#define OSCOFF              (0x0020)
#define SCG0                (0x0040)
#define SCG1                (0x0080)

/* Low Power Modes coded with Bits 4-7 in SR */

#define LPM0_bits           (CPUOFF)
#define LPM1_bits           (SCG0+CPUOFF)
#define LPM2_bits           (SCG1+CPUOFF)
#define LPM3_bits           (SCG1+SCG0+CPUOFF)
#define LPM4_bits           (SCG1+SCG0+OSCOFF+CPUOFF)


#define LPM0      __bis_SR_register(LPM0_bits)     /* Enter Low Power Mode 0 */
#define LPM0_EXIT __bic_SR_register_on_exit(LPM0_bits) /* Exit Low Power Mode 0 */
#define LPM1      __bis_SR_register(LPM1_bits)     /* Enter Low Power Mode 1 */
#define LPM1_EXIT __bic_SR_register_on_exit(LPM1_bits) /* Exit Low Power Mode 1 */
#define LPM2      __bis_SR_register(LPM2_bits)     /* Enter Low Power Mode 2 */
#define LPM2_EXIT __bic_SR_register_on_exit(LPM2_bits) /* Exit Low Power Mode 2 */
#define LPM3      __bis_SR_register(LPM3_bits)     /* Enter Low Power Mode 3 */
#define LPM3_EXIT __bic_SR_register_on_exit(LPM3_bits) /* Exit Low Power Mode 3 */
#define LPM4      __bis_SR_register(LPM4_bits)     /* Enter Low Power Mode 4 */
#define LPM4_EXIT __bic_SR_register_on_exit(LPM4_bits) /* Exit Low Power Mode 4 */



/*-------------------------------------------------------------------------
 *   Special Function
 *-------------------------------------------------------------------------*/



__no_init volatile union
{
  unsigned char IE1;   /* Interrupt Enable 1  */

  struct
  {
    unsigned char WDTIE           : 1; /*   */
    unsigned char OFIE            : 1; /*   */
    unsigned char                : 2;
    unsigned char NMIIE           : 1; /*   */
    unsigned char ACCVIE          : 1; /*   */
    unsigned char URXIE0          : 1; /*   */
    unsigned char UTXIE0          : 1; /*   */
  }IE1_bit;
} @ 0x0000;


enum {
  WDTIE           = 0x0001,
  OFIE            = 0x0002,
  NMIIE           = 0x0010,
  ACCVIE          = 0x0020,
  URXIE0          = 0x0040,
  UTXIE0          = 0x0080
};


__no_init volatile union
{
  unsigned char IFG1;   /* Interrupt Flag 1  */

  struct
  {
    unsigned char WDTIFG          : 1; /*   */
    unsigned char OFIFG           : 1; /*   */
    unsigned char                : 2;
    unsigned char NMIIFG          : 1; /*   */
    unsigned char                : 1;
    unsigned char URXIFG0         : 1; /*   */
    unsigned char UTXIFG0         : 1; /*   */
  }IFG1_bit;
} @ 0x0002;


enum {
  WDTIFG          = 0x0001,
  OFIFG           = 0x0002,
  NMIIFG          = 0x0010,
  URXIFG0         = 0x0040,
  UTXIFG0         = 0x0080
};


__no_init volatile union
{
  unsigned char ME1;   /* Module Enable 1  */

  struct
  {
    unsigned char                : 6;
    unsigned char URXE0           : 1; /*   */
    unsigned char UTXE0           : 1; /*   */
  }ME1_bit;
} @ 0x0004;


enum {
  URXE0           = 0x0040,
  UTXE0           = 0x0080
};


__no_init volatile union
{
  unsigned char IE2;   /* Interrupt Enable 2  */

  struct
  {
    unsigned char                : 4;
    unsigned char URXIE1          : 1; /*   */
    unsigned char UTXIE1          : 1; /*   */
    unsigned char                : 1;
    unsigned char BTIE            : 1; /*   */
  }IE2_bit;
} @ 0x0001;


enum {
  URXIE1          = 0x0010,
  UTXIE1          = 0x0020,
  BTIE            = 0x0080
};


__no_init volatile union
{
  unsigned char IFG2;   /* Interrupt Flag 2  */

  struct
  {
    unsigned char                : 4;
    unsigned char URXIFG1         : 1; /*   */
    unsigned char UTXIFG1         : 1; /*   */
    unsigned char                : 1;
    unsigned char BTIFG           : 1; /*   */
  }IFG2_bit;
} @ 0x0003;


enum {
  URXIFG1         = 0x0010,
  UTXIFG1         = 0x0020,
  BTIFG           = 0x0080
};


__no_init volatile union
{
  unsigned char ME2;   /* Module Enable 2  */

  struct
  {
    unsigned char                : 4;
    unsigned char URXE1           : 1; /*   */
    unsigned char UTXE1           : 1; /*   */
  }ME2_bit;
} @ 0x0005;


enum {
  URXE1           = 0x0010,
  UTXE1           = 0x0020
};



#define U0IE                IE1       /* UART0 Interrupt Enable Register */
#define U0IFG               IFG1      /* UART0 Interrupt Flag Register */
#define U0ME                ME1       /* UART0 Module Enable Register */
#define USPIE0              (0x40)
#define U1IE                IE2       /* UART1 Interrupt Enable Register */
#define U1IFG               IFG2     /* UART1 Interrupt Flag Register */
#define U1ME                ME2       /* UART1 Module Enable Register */
#define USPIE1              (0x10)

/*-------------------------------------------------------------------------
 *   Watchdog Timer
 *-------------------------------------------------------------------------*/



