hjgqx996/GdkyWork/GSWCJ2019/sources/bsp/msp430x44x/io430f448.h
__no_init volatile union
{
  unsigned char SCFI0;   /* System Clock Frequency Integrator 0  */

  struct
  {
    unsigned char                : 2;
    unsigned char FN_2            : 1; /*  */
    unsigned char FN_3            : 1; /*  */
    unsigned char FN_4            : 1; /*  */
    unsigned char FN_8            : 1; /*  */
    unsigned char FLLD0           : 1; /* Loop Divider Bit : 0  */
    unsigned char FLLD1           : 1; /* Loop Divider Bit : 1  */
  }SCFI0_bit;
} @ 0x0050;


enum {
  FN_2            = 0x0004,
  FN_3            = 0x0008,
  FN_4            = 0x0010,
  FN_8            = 0x0020,
  FLLD0           = 0x0040,
  FLLD1           = 0x0080
};


  /* System Clock Frequency Integrator 1  */
__no_init volatile unsigned char SCFI1 @ 0x0051;



  /* System Clock Frequency Control  */
__no_init volatile unsigned char SCFQCTL @ 0x0052;



__no_init volatile union
{
  unsigned char FLL_CTL0;   /* FLL+ Control 0  */

  struct
  {
    unsigned char DCOF            : 1; /* DCO Fault Flag  */
    unsigned char LFOF            : 1; /* Low Frequency Oscillator Fault Flag  */
    unsigned char XT1OF           : 1; /* High Frequency Oscillator 1 Fault Flag  */
    unsigned char XT2OF           : 1; /* High Frequency Oscillator 2 Fault Flag  */
    unsigned char OSCCAP0         : 1; /* XIN/XOUT Cap 0  */
    unsigned char OSCCAP1         : 1; /* XIN/XOUT Cap 1  */
    unsigned char XTS_FLL         : 1; /*  */
    unsigned char DCOPLUS         : 1; /* DCO+ Enable  */
  }FLL_CTL0_bit;
} @ 0x0053;


enum {
  DCOF            = 0x0001,
  LFOF            = 0x0002,
  XT1OF           = 0x0004,
  XT2OF           = 0x0008,
  OSCCAP0         = 0x0010,
  OSCCAP1         = 0x0020,
  XTS_FLL         = 0x0040,
  DCOPLUS         = 0x0080
};


__no_init volatile union
{
  unsigned char FLL_CTL1;   /* FLL+ Control 1  */

  struct
  {
    unsigned char FLL_DIV0        : 1; /*  */
    unsigned char FLL_DIV1        : 1; /*  */
    unsigned char SELS            : 1; /* Peripheral Module Clock Source (0: DCO, 1: XT2)  */
    unsigned char SELM0           : 1; /* MCLK Source Select 0  */
    unsigned char SELM1           : 1; /* MCLK Source Select 1  */
    unsigned char XT2OFF          : 1; /* High Frequency Oscillator 2 (XT2) disable  */
    unsigned char SMCLKOFF        : 1; /* Peripheral Module Clock (SMCLK) disable  */
  }FLL_CTL1_bit;
} @ 0x0054;


enum {
  FLL_DIV0        = 0x0001,
  FLL_DIV1        = 0x0002,
  SELS            = 0x0004,
  SELM0           = 0x0008,
  SELM1           = 0x0010,
  XT2OFF          = 0x0020,
  SMCLKOFF        = 0x0040
};



#define __MSP430_HAS_FLLPLUS__        /* Definition to show that Module is available */

#define FLLD_1              (0x00)    /* Multiply Selected Loop Freq. By 1 */
#define FLLD_2              (0x40)    /* Multiply Selected Loop Freq. By 2 */
#define FLLD_4              (0x80)    /* Multiply Selected Loop Freq. By 4 */
#define FLLD_8              (0xC0)    /* Multiply Selected Loop Freq. By 8 */
/* #define SCFQ_32K            0x00                        fMCLK=1*fACLK       only a range from */
#define SCFQ_64K            (0x01)                     /* fMCLK=2*fACLK          1+1 to 127+1 is possible */
#define SCFQ_128K           (0x03)                     /* fMCLK=4*fACLK */
#define SCFQ_256K           (0x07)                     /* fMCLK=8*fACLK */
#define SCFQ_512K           (0x0F)                     /* fMCLK=16*fACLK */
#define SCFQ_1M             (0x1F)                     /* fMCLK=32*fACLK */
#define SCFQ_2M             (0x3F)                     /* fMCLK=64*fACLK */
#define SCFQ_4M             (0x7F)                     /* fMCLK=128*fACLK */
#define SCFQ_M              (0x80)                     /* Modulation Disable */

#define XCAP0PF             (0x00)                     /* XIN Cap = XOUT Cap = 0pf */
#define XCAP10PF            (0x10)                     /* XIN Cap = XOUT Cap = 10pf */
#define XCAP14PF            (0x20)                     /* XIN Cap = XOUT Cap = 14pf */
#define XCAP18PF            (0x30)                     /* XIN Cap = XOUT Cap = 18pf */
#define OSCCAP_0            (0x00)                     /* XIN Cap = XOUT Cap = 0pf */
#define OSCCAP_1            (0x10)                     /* XIN Cap = XOUT Cap = 10pf */
#define OSCCAP_2            (0x20)                     /* XIN Cap = XOUT Cap = 14pf */
#define OSCCAP_3            (0x30)                     /* XIN Cap = XOUT Cap = 18pf */

#define FLL_DIV_1           (0x00)                     /* FLL+ Divide Px.x/ACLK By 1 */
#define FLL_DIV_2           (0x01)                     /* FLL+ Divide Px.x/ACLK By 2 */
#define FLL_DIV_4           (0x02)                     /* FLL+ Divide Px.x/ACLK By 4 */
#define FLL_DIV_8           (0x03)                     /* FLL+ Divide Px.x/ACLK By 8 */

#define SELM_DCO            (0x00)                     /* Select DCO for CPU MCLK */
#define SELM_XT2            (0x10)                     /* Select XT2 for CPU MCLK */
#define SELM_A              (0x18)                     /* Select A (from LFXT1) for CPU MCLK */

/*-------------------------------------------------------------------------
 *   Supply Voltage Supervisor
 *-------------------------------------------------------------------------*/



__no_init volatile union
{
  unsigned char SVSCTL;   /* SVS Control  */

  struct
  {
    unsigned char SVSFG           : 1; /* SVS Flag  */
    unsigned char SVSOP           : 1; /* SVS output (read only)  */
    unsigned char SVSON           : 1; /* Switches the SVS on/off  */
    unsigned char PORON           : 1; /* Enable POR Generation if Low Voltage  */
    unsigned char VLD0            : 1; /*   */
    unsigned char VLD1            : 1; /*   */
    unsigned char VLD2            : 1; /*   */
    unsigned char VLD3            : 1; /*   */
  }SVSCTL_bit;
} @ 0x0056;


enum {
  SVSFG           = 0x0001,
  SVSOP           = 0x0002,
  SVSON           = 0x0004,
  PORON           = 0x0008,
  VLD0            = 0x0010,
  VLD1            = 0x0020,
  VLD2            = 0x0040,
  VLD3            = 0x0080
};



#define __MSP430_HAS_SVS__            /* Definition to show that Module is available */

#define VLDON               (0x10)
#define VLDOFF              (0x00)
#define VLD_1_8V            (0x10)

/*-------------------------------------------------------------------------
 *   LCD
 *-------------------------------------------------------------------------*/



