hjgqx996/GdkyWork/GSWCJ2019/sources/bsp/msp430x44x/io430f448.h
__no_init volatile union
{
  unsigned char LCDCTL;   /* LCD Control  */

  struct
  {
    unsigned char LCDON           : 1; /*   */
    unsigned char                : 1;
    unsigned char LCDSON          : 1; /*   */
    unsigned char LCDMX0          : 1; /*   */
    unsigned char LCDMX1          : 1; /*   */
    unsigned char LCDP0           : 1; /*   */
    unsigned char LCDP1           : 1; /*   */
    unsigned char LCDP2           : 1; /*   */
  }LCDCTL_bit;
} @ 0x0090;


enum {
  LCDON           = 0x0001,
  LCDSON          = 0x0004,
  LCDMX0          = 0x0008,
  LCDMX1          = 0x0010,
  LCDP0           = 0x0020,
  LCDP1           = 0x0040,
  LCDP2           = 0x0080
};


  /* LCD Memory 1  */
__no_init volatile unsigned char LCDM1 @ 0x0091;



  /* LCD Memory 2  */
__no_init volatile unsigned char LCDM2 @ 0x0092;



  /* LCD Memory 3  */
__no_init volatile unsigned char LCDM3 @ 0x0093;



  /* LCD Memory 4  */
__no_init volatile unsigned char LCDM4 @ 0x0094;



  /* LCD Memory 5  */
__no_init volatile unsigned char LCDM5 @ 0x0095;



  /* LCD Memory 6  */
__no_init volatile unsigned char LCDM6 @ 0x0096;



  /* LCD Memory 7  */
__no_init volatile unsigned char LCDM7 @ 0x0097;



  /* LCD Memory 8  */
__no_init volatile unsigned char LCDM8 @ 0x0098;



  /* LCD Memory 9  */
__no_init volatile unsigned char LCDM9 @ 0x0099;



  /* LCD Memory 10  */
__no_init volatile unsigned char LCDM10 @ 0x009A;



  /* LCD Memory 11  */
__no_init volatile unsigned char LCDM11 @ 0x009B;



  /* LCD Memory 12  */
__no_init volatile unsigned char LCDM12 @ 0x009C;



  /* LCD Memory 13  */
__no_init volatile unsigned char LCDM13 @ 0x009D;



  /* LCD Memory 14  */
__no_init volatile unsigned char LCDM14 @ 0x009E;



  /* LCD Memory 15  */
__no_init volatile unsigned char LCDM15 @ 0x009F;



  /* LCD Memory 16  */
__no_init volatile unsigned char LCDM16 @ 0x00A0;



  /* LCD Memory 17  */
__no_init volatile unsigned char LCDM17 @ 0x00A1;



  /* LCD Memory 18  */
__no_init volatile unsigned char LCDM18 @ 0x00A2;



  /* LCD Memory 19  */
__no_init volatile unsigned char LCDM19 @ 0x00A3;



  /* LCD Memory 20  */
__no_init volatile unsigned char LCDM20 @ 0x00A4;


#define __MSP430_HAS_LCD4__           /* Definition to show that Module is available */
/* Display modes coded with Bits 2-4 */
#define LCDSTATIC           (LCDSON)
#define LCD2MUX             (LCDMX0+LCDSON)
#define LCD3MUX             (LCDMX1+LCDSON)
#define LCD4MUX             (LCDMX1+LCDMX0+LCDSON)
/* Group select code with Bits 5-7                     Seg.lines   Dig.output */
#define LCDSG0              (0x00)                    /* ---------   Port Only (default) */
#define LCDSG0_1            (LCDP0)                   /* S0  - S15   see Datasheet */
#define LCDSG0_2            (LCDP1)                   /* S0  - S19   see Datasheet */
#define LCDSG0_3            (LCDP1+LCDP0)             /* S0  - S23   see Datasheet */
#define LCDSG0_4            (LCDP2)                   /* S0  - S27   see Datasheet */
#define LCDSG0_5            (LCDP2+LCDP0)             /* S0  - S31   see Datasheet */
#define LCDSG0_6            (LCDP2+LCDP1)             /* S0  - S35   see Datasheet */
#define LCDSG0_7            (LCDP2+LCDP1+LCDP0)       /* S0  - S39   see Datasheet */
/* MOV  #LCDSG0_3+LCDOG2_7,&LCDCTL ACTUALY MEANS MOV  #LCDP1,&LCDCTL! */
#define LCDOG1_7            (0x00)                    /* ---------   Port Only (default) */
#define LCDOG2_7            (LCDP0)                   /* S0  - S15   see Datasheet */
#define LCDOG3_7            (LCDP1)                   /* S0  - S19   see Datasheet */
#define LCDOG4_7            (LCDP1+LCDP0)             /* S0  - S23   see Datasheet */
#define LCDOG5_7            (LCDP2)                   /* S0  - S27   see Datasheet */
#define LCDOG6_7            (LCDP2+LCDP0)             /* S0  - S31   see Datasheet */
#define LCDOG7              (LCDP2+LCDP1)             /* S0  - S35   see Datasheet */
#define LCDOGOFF            (LCDP2+LCDP1+LCDP0)       /* S0  - S39   see Datasheet */

#define LCDMEM_             (0x0091u)  /* LCD Memory */
#ifndef __IAR_SYSTEMS_ICC__
#define LCDMEM              (LCDMEM_) /* LCD Memory (for assembler) */
#else
#define LCDMEM              ((char*) LCDMEM_) /* LCD Memory (for C) */
#endif

#define LCDMA               (LCDM10)  /* LCD Memory A */
#define LCDMB               (LCDM11)  /* LCD Memory B */
#define LCDMC               (LCDM12)  /* LCD Memory C */
#define LCDMD               (LCDM13)  /* LCD Memory D */
#define LCDME               (LCDM14)  /* LCD Memory E */
#define LCDMF               (LCDM15)  /* LCD Memory F */

/*-------------------------------------------------------------------------
 *   USART 0  UART/SPI Mode
 *-------------------------------------------------------------------------*/



__no_init volatile union
{
  unsigned char U0CTL;   /* USART 0 Control  */

  struct
  {
    unsigned char SWRST           : 1; /* USART Software Reset  */
    unsigned char MM              : 1; /* Master Mode off/on  */
    unsigned char SYNC            : 1; /* UART / SPI mode  */
    unsigned char LISTEN          : 1; /* Listen mode  */
    unsigned char CHAR            : 1; /* Data 0:7-bits / 1:8-bits  */
    unsigned char SPB             : 1; /* Stop Bits 0:one / 1: two  */
    unsigned char PEV             : 1; /* Parity 0:odd / 1:even  */
    unsigned char PENA            : 1; /* Parity enable  */
  }U0CTL_bit;
} @ 0x0070;


enum {
  SWRST           = 0x0001,
  MM              = 0x0002,
  SYNC            = 0x0004,
  LISTEN          = 0x0008,
  CHAR            = 0x0010,
  SPB             = 0x0020,
  PEV             = 0x0040,
  PENA            = 0x0080
};


__no_init volatile union
{
  unsigned char U0TCTL;   /* USART 0 Transmit Control  */

  struct
  {
    unsigned char TXEPT           : 1; /* TX Buffer empty  */
    unsigned char STC             : 1; /* SPI: STC enable 0:on / 1:off  */
    unsigned char TXWAKE          : 1; /* TX Wake up mode  */
    unsigned char URXSE           : 1; /* Receive Start edge select  */
    unsigned char SSEL0           : 1; /* Clock Source Select 0  */
    unsigned char SSEL1           : 1; /* Clock Source Select 1  */
    unsigned char CKPL            : 1; /* Clock Polarity  */
    unsigned char CKPH            : 1; /* SPI: Clock Phase  */
  }U0TCTL_bit;
} @ 0x0071;


enum {
  TXEPT           = 0x0001,
  STC             = 0x0002,
  TXWAKE          = 0x0004,
  URXSE           = 0x0008,
  SSEL0           = 0x0010,
  SSEL1           = 0x0020,
  CKPL            = 0x0040,
  CKPH            = 0x0080
};


