hjgqx996/GdkyWork/GSWCJ2019/sources/bsp/msp430x44x/io430f448.h
__no_init volatile union
{
  unsigned char U0RCTL;   /* USART 0 Receive Control  */

  struct
  {
    unsigned char RXERR           : 1; /* RX Error Error  */
    unsigned char RXWAKE          : 1; /* RX Wake up detect  */
    unsigned char URXWIE          : 1; /* RX Wake up interrupt enable  */
    unsigned char URXEIE          : 1; /* RX Error interrupt enable  */
    unsigned char BRK             : 1; /* Break detected  */
    unsigned char OE              : 1; /* Overrun Error  */
    unsigned char PE              : 1; /* Parity Error  */
    unsigned char FE              : 1; /* Frame Error  */
  }U0RCTL_bit;
} @ 0x0072;


enum {
  RXERR           = 0x0001,
  RXWAKE          = 0x0002,
  URXWIE          = 0x0004,
  URXEIE          = 0x0008,
  BRK             = 0x0010,
  OE              = 0x0020,
  PE              = 0x0040,
  FE              = 0x0080
};


  /* USART 0 Modulation Control  */
__no_init volatile unsigned char U0MCTL @ 0x0073;



  /* USART 0 Baud Rate 0  */
__no_init volatile unsigned char U0BR0 @ 0x0074;



  /* USART 0 Baud Rate 1  */
__no_init volatile unsigned char U0BR1 @ 0x0075;



  /* USART 0 Receive Buffer  */
__no_init volatile unsigned __READ char U0RXBUF @ 0x0076;



  /* USART 0 Transmit Buffer  */
__no_init volatile unsigned char U0TXBUF @ 0x0077;


#define __MSP430_HAS_UART0__          /* Definition to show that Module is available */

#define UCTL0               U0CTL     /* USART 0 Control */
#define UTCTL0              U0TCTL    /* USART 0 Transmit Control */
#define URCTL0              U0RCTL    /* USART 0 Receive Control */
#define UMCTL0              U0MCTL    /* USART 0 Modulation Control */
#define UBR00               U0BR0     /* USART 0 Baud Rate 0 */
#define UBR10               U0BR1     /* USART 0 Baud Rate 1 */
#define RXBUF0              U0RXBUF   /* USART 0 Receive Buffer */
#define TXBUF0              U0TXBUF   /* USART 0 Transmit Buffer */
#define UCTL0_              U0CTL_    /* USART 0 Control */
#define UTCTL0_             U0TCTL_   /* USART 0 Transmit Control */
#define URCTL0_             U0RCTL_   /* USART 0 Receive Control */
#define UMCTL0_             U0MCTL_   /* USART 0 Modulation Control */
#define UBR00_              U0BR0_    /* USART 0 Baud Rate 0 */
#define UBR10_              U0BR1_    /* USART 0 Baud Rate 1 */
#define RXBUF0_             U0RXBUF_  /* USART 0 Receive Buffer */
#define TXBUF0_             U0TXBUF_  /* USART 0 Transmit Buffer */
#define UCTL_0              U0CTL     /* USART 0 Control */
#define UTCTL_0             U0TCTL    /* USART 0 Transmit Control */
#define URCTL_0             U0RCTL    /* USART 0 Receive Control */
#define UMCTL_0             U0MCTL    /* USART 0 Modulation Control */
#define UBR0_0              U0BR0     /* USART 0 Baud Rate 0 */
#define UBR1_0              U0BR1     /* USART 0 Baud Rate 1 */
#define RXBUF_0             U0RXBUF   /* USART 0 Receive Buffer */
#define TXBUF_0             U0TXBUF   /* USART 0 Transmit Buffer */
#define UCTL_0_             U0CTL_    /* USART 0 Control */
#define UTCTL_0_            U0TCTL_   /* USART 0 Transmit Control */
#define URCTL_0_            U0RCTL_   /* USART 0 Receive Control */
#define UMCTL_0_            U0MCTL_   /* USART 0 Modulation Control */
#define UBR0_0_             U0BR0_    /* USART 0 Baud Rate 0 */
#define UBR1_0_             U0BR1_    /* USART 0 Baud Rate 1 */
#define RXBUF_0_            U0RXBUF_  /* USART 0 Receive Buffer */
#define TXBUF_0_            U0TXBUF_  /* USART 0 Transmit Buffer */

/*-------------------------------------------------------------------------
 *   USART 1
 *-------------------------------------------------------------------------*/



__no_init volatile union
{
  unsigned char U1CTL;   /* USART 1 Control  */

  struct
  {
    unsigned char SWRST           : 1; /* USART Software Reset  */
    unsigned char MM              : 1; /* Master Mode off/on  */
    unsigned char SYNC            : 1; /* UART / SPI mode  */
    unsigned char LISTEN          : 1; /* Listen mode  */
    unsigned char CHAR            : 1; /* Data 0:7-bits / 1:8-bits  */
    unsigned char SPB             : 1; /* Stop Bits 0:one / 1: two  */
    unsigned char PEV             : 1; /* Parity 0:odd / 1:even  */
    unsigned char PENA            : 1; /* Parity enable  */
  }U1CTL_bit;
} @ 0x0078;


/*
enum {
  SWRST           = 0x0001,
  MM              = 0x0002,
  SYNC            = 0x0004,
  LISTEN          = 0x0008,
  CHAR            = 0x0010,
  SPB             = 0x0020,
  PEV             = 0x0040,
  PENA            = 0x0080,
};

*/

__no_init volatile union
{
  unsigned char U1TCTL;   /* USART 1 Transmit Control  */

  struct
  {
    unsigned char TXEPT           : 1; /* TX Buffer empty  */
    unsigned char STC             : 1; /* SPI: STC enable 0:on / 1:off  */
    unsigned char TXWAKE          : 1; /* TX Wake up mode  */
    unsigned char URXSE           : 1; /* Receive Start edge select  */
    unsigned char SSEL0           : 1; /* Clock Source Select 0  */
    unsigned char SSEL1           : 1; /* Clock Source Select 1  */
    unsigned char CKPL            : 1; /* Clock Polarity  */
    unsigned char CKPH            : 1; /* SPI: Clock Phase  */
  }U1TCTL_bit;
} @ 0x0079;


/*
enum {
  TXEPT           = 0x0001,
  STC             = 0x0002,
  TXWAKE          = 0x0004,
  URXSE           = 0x0008,
  SSEL0           = 0x0010,
  SSEL1           = 0x0020,
  CKPL            = 0x0040,
  CKPH            = 0x0080,
};

*/

__no_init volatile union
{
  unsigned char U1RCTL;   /* USART 1 Receive Control  */

  struct
  {
    unsigned char RXERR           : 1; /* RX Error Error  */
    unsigned char RXWAKE          : 1; /* RX Wake up detect  */
    unsigned char URXWIE          : 1; /* RX Wake up interrupt enable  */
    unsigned char URXEIE          : 1; /* RX Error interrupt enable  */
    unsigned char BRK             : 1; /* Break detected  */
    unsigned char OE              : 1; /* Overrun Error  */
    unsigned char PE              : 1; /* Parity Error  */
    unsigned char FE              : 1; /* Frame Error  */
  }U1RCTL_bit;
} @ 0x007A;


