hjgqx996/GdkyWork/GSWCJ2019/sources/bsp/msp430x44x/io430f448.h
__no_init volatile union
{
  unsigned short FCTL1;   /* FLASH Control 1  */

  struct
  {
    unsigned short                : 1;
    unsigned short ERASE           : 1; /* Enable bit for Flash segment erase  */
    unsigned short MERAS           : 1; /* Enable bit for Flash mass erase  */
    unsigned short                : 3;
    unsigned short WRT             : 1; /* Enable bit for Flash write  */
    unsigned short BLKWRT          : 1; /* Enable bit for Flash segment write  */
  }FCTL1_bit;
} @ 0x0128;


enum {
  ERASE           = 0x0002,
  MERAS           = 0x0004,
  WRT             = 0x0040,
  BLKWRT          = 0x0080
};


__no_init volatile union
{
  unsigned short FCTL2;   /* FLASH Control 2  */

  struct
  {
    unsigned short FN0             : 1; /* Divide Flash clock by 1 to 64 using FN0 to FN5 according to:  */
    unsigned short FN1             : 1; /* 32*FN5 + 16*FN4 + 8*FN3 + 4*FN2 + 2*FN1 + FN0 + 1  */
    unsigned short FN2             : 1; /*   */
    unsigned short FN3             : 1; /*   */
    unsigned short FN4             : 1; /*   */
    unsigned short FN5             : 1; /*   */
    unsigned short FSSEL0          : 1; /* Flash clock select 0  */
    unsigned short FSSEL1          : 1; /* Flash clock select 1  */
  }FCTL2_bit;
} @ 0x012A;


enum {
  FN0             = 0x0001,
  FN1             = 0x0002,
  FN2             = 0x0004,
  FN3             = 0x0008,
  FN4             = 0x0010,
  FN5             = 0x0020,
  FSSEL0          = 0x0040,
  FSSEL1          = 0x0080
};


__no_init volatile union
{
  unsigned short FCTL3;   /* FLASH Control 3  */

  struct
  {
    unsigned short BUSY            : 1; /* Flash busy: 1  */
    unsigned short KEYV            : 1; /* Flash Key violation flag  */
    unsigned short ACCVIFG         : 1; /* Flash Access violation flag  */
    unsigned short WAIT            : 1; /* Wait flag for segment write  */
    unsigned short LOCK            : 1; /* Lock bit: 1 - Flash is locked (read only)  */
    unsigned short EMEX            : 1; /* Flash Emergency Exit  */
  }FCTL3_bit;
} @ 0x012C;


enum {
  BUSY            = 0x0001,
  KEYV            = 0x0002,
  ACCVIFG         = 0x0004,
  WAIT            = 0x0008,
  LOCK            = 0x0010,
  EMEX            = 0x0020
};



#define __MSP430_HAS_FLASH__          /* Definition to show that Module is available */

#define FRKEY               (0x9600u)  /* Flash key returned by read */
#define FWKEY               (0xA500u)  /* Flash key for write */
#define FXKEY               (0x3300u)  /* for use with XOR instruction */
#define SEGWRT              (0x0080u)  /* old definition */ /* Enable bit for Flash segment write */

#define FSSEL_0             (0x0000u)  /* Flash clock select: 0 - ACLK */
#define FSSEL_1             (0x0040u)  /* Flash clock select: 1 - MCLK */
#define FSSEL_2             (0x0080u)  /* Flash clock select: 2 - SMCLK */
#define FSSEL_3             (0x00C0u)  /* Flash clock select: 3 - SMCLK */

/*-------------------------------------------------------------------------
 *   Comparator A
 *-------------------------------------------------------------------------*/



__no_init volatile union
{
  unsigned char CACTL1;   /* Comparator A Control 1  */

  struct
  {
    unsigned char CAIFG           : 1; /* Comp. A Interrupt Flag  */
    unsigned char CAIE            : 1; /* Comp. A Interrupt Enable  */
    unsigned char CAIES           : 1; /* Comp. A Int. Edge Select: 0:rising / 1:falling  */
    unsigned char CAON            : 1; /* Comp. A enable  */
    unsigned char CAREF0          : 1; /* Comp. A Internal Reference Select 0  */
    unsigned char CAREF1          : 1; /* Comp. A Internal Reference Select 1  */
    unsigned char CARSEL          : 1; /* Comp. A Internal Reference Enable  */
    unsigned char CAEX            : 1; /* Comp. A Exchange Inputs  */
  }CACTL1_bit;
} @ 0x0059;


enum {
  CAIFG           = 0x0001,
  CAIE            = 0x0002,
  CAIES           = 0x0004,
  CAON            = 0x0008,
  CAREF0          = 0x0010,
  CAREF1          = 0x0020,
  CARSEL          = 0x0040,
  CAEX            = 0x0080
};


__no_init volatile union
{
  unsigned char CACTL2;   /* Comparator A Control 2  */

  struct
  {
    unsigned char CAOUT           : 1; /* Comp. A Output  */
    unsigned char CAF             : 1; /* Comp. A Enable Output Filter  */
    unsigned char P2CA0           : 1; /* Comp. A Connect External Signal to CA0 : 1  */
    unsigned char P2CA1           : 1; /* Comp. A Connect External Signal to CA1 : 1  */
    unsigned char CACTL24         : 1; /*   */
    unsigned char CACTL25         : 1; /*   */
    unsigned char CACTL26         : 1; /*   */
    unsigned char CACTL27         : 1; /*   */
  }CACTL2_bit;
} @ 0x005A;


enum {
  CAOUT           = 0x0001,
  CAF             = 0x0002,
  P2CA0           = 0x0004,
  P2CA1           = 0x0008,
  CACTL24         = 0x0010,
  CACTL25         = 0x0020,
  CACTL26         = 0x0040,
  CACTL27         = 0x0080
};


__no_init volatile union
{
  unsigned char CAPD;   /* Comparator A Port Disable  */

  struct
  {
    unsigned char CAPD0           : 1; /* Comp. A Disable Input Buffer of Port Register .0  */
    unsigned char CAPD1           : 1; /* Comp. A Disable Input Buffer of Port Register .1  */
    unsigned char CAPD2           : 1; /* Comp. A Disable Input Buffer of Port Register .2  */
    unsigned char CAPD3           : 1; /* Comp. A Disable Input Buffer of Port Register .3  */
    unsigned char CAPD4           : 1; /* Comp. A Disable Input Buffer of Port Register .4  */
    unsigned char CAPD5           : 1; /* Comp. A Disable Input Buffer of Port Register .5  */
    unsigned char CAPD6           : 1; /* Comp. A Disable Input Buffer of Port Register .6  */
    unsigned char CAPD7           : 1; /* Comp. A Disable Input Buffer of Port Register .7  */
  }CAPD_bit;
} @ 0x005B;


enum {
  CAPD0           = 0x0001,
  CAPD1           = 0x0002,
  CAPD2           = 0x0004,
  CAPD3           = 0x0008,
  CAPD4           = 0x0010,
  CAPD5           = 0x0020,
  CAPD6           = 0x0040,
  CAPD7           = 0x0080
};



