hjgqx996/GdkyWork/GSWCJ2019/sources/bsp/msp430x44x/io430f448.h
#define __MSP430_HAS_COMPA__          /* Definition to show that Module is available */

#define CAREF_0             (0x00)    /* Comp. A Int. Ref. Select 0 : Off */
#define CAREF_1             (0x10)    /* Comp. A Int. Ref. Select 1 : 0.25*Vcc */
#define CAREF_2             (0x20)    /* Comp. A Int. Ref. Select 2 : 0.5*Vcc */
#define CAREF_3             (0x30)    /* Comp. A Int. Ref. Select 3 : Vt*/

/*-------------------------------------------------------------------------
 *   ADC12
 *-------------------------------------------------------------------------*/



__no_init volatile union
{
  unsigned short ADC12CTL0;   /* ADC12 Control 0  */

  struct
  {
    unsigned short ADC12SC         : 1; /* ADC12 Start Conversion  */
    unsigned short ENC             : 1; /* ADC12 Enable Conversion  */
    unsigned short ADC12TOVIE      : 1; /* ADC12 Timer Overflow interrupt enable  */
    unsigned short ADC12OVIE       : 1; /* ADC12 Overflow interrupt enable  */
    unsigned short ADC12ON         : 1; /* ADC12 On/enable  */
    unsigned short REFON           : 1; /* ADC12 Reference on  */
    unsigned short REF2_5V         : 1; /*  */
    unsigned short MSC             : 1; /* ADC12 Multiple SampleConversion  */
    unsigned short SHT00           : 1; /* ADC12 Sample Hold 0 Select 0  */
    unsigned short SHT01           : 1; /* ADC12 Sample Hold 0 Select 1  */
    unsigned short SHT02           : 1; /* ADC12 Sample Hold 0 Select 2  */
    unsigned short SHT03           : 1; /* ADC12 Sample Hold 0 Select 3  */
    unsigned short SHT10           : 1; /* ADC12 Sample Hold 0 Select 0  */
    unsigned short SHT11           : 1; /* ADC12 Sample Hold 1 Select 1  */
    unsigned short SHT12           : 1; /* ADC12 Sample Hold 2 Select 2  */
    unsigned short SHT13           : 1; /* ADC12 Sample Hold 3 Select 3  */
  }ADC12CTL0_bit;
} @ 0x01A0;


enum {
  ADC12SC         = 0x0001,
  ENC             = 0x0002,
  ADC12TOVIE      = 0x0004,
  ADC12OVIE       = 0x0008,
  ADC12ON         = 0x0010,
  REFON           = 0x0020,
  REF2_5V         = 0x0040,
  MSC             = 0x0080,
  SHT00           = 0x0100,
  SHT01           = 0x0200,
  SHT02           = 0x0400,
  SHT03           = 0x0800,
  SHT10           = 0x1000,
  SHT11           = 0x2000,
  SHT12           = 0x4000,
  SHT13           = 0x8000
};


__no_init volatile union
{
  unsigned short ADC12CTL1;   /* ADC12 Control 1  */

  struct
  {
    unsigned short ADC12BUSY       : 1; /* ADC12 Busy  */
    unsigned short CONSEQ0         : 1; /* ADC12 Conversion Sequence Select 0  */
    unsigned short CONSEQ1         : 1; /* ADC12 Conversion Sequence Select 1  */
    unsigned short ADC12SSEL0      : 1; /* ADC12 Clock Source Select 0  */
    unsigned short ADC12SSEL1      : 1; /* ADC12 Clock Source Select 1  */
    unsigned short ADC12DIV0       : 1; /* ADC12 Clock Divider Select 0  */
    unsigned short ADC12DIV1       : 1; /* ADC12 Clock Divider Select 1  */
    unsigned short ADC12DIV2       : 1; /* ADC12 Clock Divider Select 2  */
    unsigned short ISSH            : 1; /* ADC12 Invert Sample Hold Signal  */
    unsigned short SHP             : 1; /* ADC12 Sample/Hold Pulse Mode  */
    unsigned short SHS0            : 1; /* ADC12 Sample/Hold Source 0  */
    unsigned short SHS1            : 1; /* ADC12 Sample/Hold Source 1  */
    unsigned short CSTARTADD0      : 1; /* ADC12 Conversion Start Address 0  */
    unsigned short CSTARTADD1      : 1; /* ADC12 Conversion Start Address 1  */
    unsigned short CSTARTADD2      : 1; /* ADC12 Conversion Start Address 2  */
    unsigned short CSTARTADD3      : 1; /* ADC12 Conversion Start Address 3  */
  }ADC12CTL1_bit;
} @ 0x01A2;


enum {
  ADC12BUSY       = 0x0001,
  CONSEQ0         = 0x0002,
  CONSEQ1         = 0x0004,
  ADC12SSEL0      = 0x0008,
  ADC12SSEL1      = 0x0010,
  ADC12DIV0       = 0x0020,
  ADC12DIV1       = 0x0040,
  ADC12DIV2       = 0x0080,
  ISSH            = 0x0100,
  SHP             = 0x0200,
  SHS0            = 0x0400,
  SHS1            = 0x0800,
  CSTARTADD0      = 0x1000,
  CSTARTADD1      = 0x2000,
  CSTARTADD2      = 0x4000,
  CSTARTADD3      = 0x8000
};


  /* ADC12 Interrupt Flag  */
__no_init volatile unsigned short ADC12IFG @ 0x01A4;



  /* ADC12 Interrupt Enable  */
__no_init volatile unsigned short ADC12IE @ 0x01A6;



  /* ADC12 Interrupt Vector Word  */
__no_init volatile unsigned short ADC12IV @ 0x01A8;



  /* ADC12 Conversion Memory 0  */
__no_init volatile unsigned short ADC12MEM0 @ 0x0140;



  /* ADC12 Conversion Memory 1  */
__no_init volatile unsigned short ADC12MEM1 @ 0x0142;



  /* ADC12 Conversion Memory 2  */
__no_init volatile unsigned short ADC12MEM2 @ 0x0144;



  /* ADC12 Conversion Memory 3  */
__no_init volatile unsigned short ADC12MEM3 @ 0x0146;



  /* ADC12 Conversion Memory 4  */
__no_init volatile unsigned short ADC12MEM4 @ 0x0148;



  /* ADC12 Conversion Memory 5  */
__no_init volatile unsigned short ADC12MEM5 @ 0x014A;



  /* ADC12 Conversion Memory 6  */
__no_init volatile unsigned short ADC12MEM6 @ 0x014C;



  /* ADC12 Conversion Memory 7  */
__no_init volatile unsigned short ADC12MEM7 @ 0x014E;



  /* ADC12 Conversion Memory 8  */
__no_init volatile unsigned short ADC12MEM8 @ 0x0150;



  /* ADC12 Conversion Memory 9  */
__no_init volatile unsigned short ADC12MEM9 @ 0x0152;



  /* ADC12 Conversion Memory 10  */
__no_init volatile unsigned short ADC12MEM10 @ 0x0154;



  /* ADC12 Conversion Memory 11  */
__no_init volatile unsigned short ADC12MEM11 @ 0x0156;



  /* ADC12 Conversion Memory 12  */
__no_init volatile unsigned short ADC12MEM12 @ 0x0158;



  /* ADC12 Conversion Memory 13  */
__no_init volatile unsigned short ADC12MEM13 @ 0x015A;



  /* ADC12 Conversion Memory 14  */
__no_init volatile unsigned short ADC12MEM14 @ 0x015C;



  /* ADC12 Conversion Memory 15  */
__no_init volatile unsigned short ADC12MEM15 @ 0x015E;



__no_init volatile union
{
  unsigned char ADC12MCTL0;   /* ADC12 Memory Control 0  */

  struct
  {
    unsigned char INCH0           : 1; /* ADC12 Input Channel Select Bit 0  */
    unsigned char INCH1           : 1; /* ADC12 Input Channel Select Bit 1  */
    unsigned char INCH2           : 1; /* ADC12 Input Channel Select Bit 2  */
    unsigned char INCH3           : 1; /* ADC12 Input Channel Select Bit 3  */
    unsigned char SREF0           : 1; /* ADC12 Select Reference Bit 0  */
    unsigned char SREF1           : 1; /* ADC12 Select Reference Bit 1  */
    unsigned char SREF2           : 1; /* ADC12 Select Reference Bit 2  */
    unsigned char EOS             : 1; /* ADC12 End of Sequence  */
  }ADC12MCTL0_bit;
} @ 0x0080;


enum {
  INCH0           = 0x0001,
  INCH1           = 0x0002,
  INCH2           = 0x0004,
  INCH3           = 0x0008,
  SREF0           = 0x0010,
  SREF1           = 0x0020,
  SREF2           = 0x0040,
  EOS             = 0x0080
};


