hjgqx996/GdkyWork/GSWCJ2019/sources/bsp/msp430x44x/io430f448.h
__no_init volatile union
{
  unsigned char ADC12MCTL1;   /* ADC12 Memory Control 1  */

  struct
  {
    unsigned char INCH0           : 1; /* ADC12 Input Channel Select Bit 0  */
    unsigned char INCH1           : 1; /* ADC12 Input Channel Select Bit 1  */
    unsigned char INCH2           : 1; /* ADC12 Input Channel Select Bit 2  */
    unsigned char INCH3           : 1; /* ADC12 Input Channel Select Bit 3  */
    unsigned char SREF0           : 1; /* ADC12 Select Reference Bit 0  */
    unsigned char SREF1           : 1; /* ADC12 Select Reference Bit 1  */
    unsigned char SREF2           : 1; /* ADC12 Select Reference Bit 2  */
    unsigned char EOS             : 1; /* ADC12 End of Sequence  */
  }ADC12MCTL1_bit;
} @ 0x0081;


/*
enum {
  INCH0           = 0x0001,
  INCH1           = 0x0002,
  INCH2           = 0x0004,
  INCH3           = 0x0008,
  SREF0           = 0x0010,
  SREF1           = 0x0020,
  SREF2           = 0x0040,
  EOS             = 0x0080,
};

*/

__no_init volatile union
{
  unsigned char ADC12MCTL2;   /* ADC12 Memory Control 2  */

  struct
  {
    unsigned char INCH0           : 1; /* ADC12 Input Channel Select Bit 0  */
    unsigned char INCH1           : 1; /* ADC12 Input Channel Select Bit 1  */
    unsigned char INCH2           : 1; /* ADC12 Input Channel Select Bit 2  */
    unsigned char INCH3           : 1; /* ADC12 Input Channel Select Bit 3  */
    unsigned char SREF0           : 1; /* ADC12 Select Reference Bit 0  */
    unsigned char SREF1           : 1; /* ADC12 Select Reference Bit 1  */
    unsigned char SREF2           : 1; /* ADC12 Select Reference Bit 2  */
    unsigned char EOS             : 1; /* ADC12 End of Sequence  */
  }ADC12MCTL2_bit;
} @ 0x0082;


/*
enum {
  INCH0           = 0x0001,
  INCH1           = 0x0002,
  INCH2           = 0x0004,
  INCH3           = 0x0008,
  SREF0           = 0x0010,
  SREF1           = 0x0020,
  SREF2           = 0x0040,
  EOS             = 0x0080,
};

*/

__no_init volatile union
{
  unsigned char ADC12MCTL3;   /* ADC12 Memory Control 3  */

  struct
  {
    unsigned char INCH0           : 1; /* ADC12 Input Channel Select Bit 0  */
    unsigned char INCH1           : 1; /* ADC12 Input Channel Select Bit 1  */
    unsigned char INCH2           : 1; /* ADC12 Input Channel Select Bit 2  */
    unsigned char INCH3           : 1; /* ADC12 Input Channel Select Bit 3  */
    unsigned char SREF0           : 1; /* ADC12 Select Reference Bit 0  */
    unsigned char SREF1           : 1; /* ADC12 Select Reference Bit 1  */
    unsigned char SREF2           : 1; /* ADC12 Select Reference Bit 2  */
    unsigned char EOS             : 1; /* ADC12 End of Sequence  */
  }ADC12MCTL3_bit;
} @ 0x0083;


/*
enum {
  INCH0           = 0x0001,
  INCH1           = 0x0002,
  INCH2           = 0x0004,
  INCH3           = 0x0008,
  SREF0           = 0x0010,
  SREF1           = 0x0020,
  SREF2           = 0x0040,
  EOS             = 0x0080,
};

*/

__no_init volatile union
{
  unsigned char ADC12MCTL4;   /* ADC12 Memory Control 4  */

  struct
  {
    unsigned char INCH0           : 1; /* ADC12 Input Channel Select Bit 0  */
    unsigned char INCH1           : 1; /* ADC12 Input Channel Select Bit 1  */
    unsigned char INCH2           : 1; /* ADC12 Input Channel Select Bit 2  */
    unsigned char INCH3           : 1; /* ADC12 Input Channel Select Bit 3  */
    unsigned char SREF0           : 1; /* ADC12 Select Reference Bit 0  */
    unsigned char SREF1           : 1; /* ADC12 Select Reference Bit 1  */
    unsigned char SREF2           : 1; /* ADC12 Select Reference Bit 2  */
    unsigned char EOS             : 1; /* ADC12 End of Sequence  */
  }ADC12MCTL4_bit;
} @ 0x0084;


/*
enum {
  INCH0           = 0x0001,
  INCH1           = 0x0002,
  INCH2           = 0x0004,
  INCH3           = 0x0008,
  SREF0           = 0x0010,
  SREF1           = 0x0020,
  SREF2           = 0x0040,
  EOS             = 0x0080,
};

*/

__no_init volatile union
{
  unsigned char ADC12MCTL5;   /* ADC12 Memory Control 5  */

  struct
  {
    unsigned char INCH0           : 1; /* ADC12 Input Channel Select Bit 0  */
    unsigned char INCH1           : 1; /* ADC12 Input Channel Select Bit 1  */
    unsigned char INCH2           : 1; /* ADC12 Input Channel Select Bit 2  */
    unsigned char INCH3           : 1; /* ADC12 Input Channel Select Bit 3  */
    unsigned char SREF0           : 1; /* ADC12 Select Reference Bit 0  */
    unsigned char SREF1           : 1; /* ADC12 Select Reference Bit 1  */
    unsigned char SREF2           : 1; /* ADC12 Select Reference Bit 2  */
    unsigned char EOS             : 1; /* ADC12 End of Sequence  */
  }ADC12MCTL5_bit;
} @ 0x0085;


/*
enum {
  INCH0           = 0x0001,
  INCH1           = 0x0002,
  INCH2           = 0x0004,
  INCH3           = 0x0008,
  SREF0           = 0x0010,
  SREF1           = 0x0020,
  SREF2           = 0x0040,
  EOS             = 0x0080,
};

*/

__no_init volatile union
{
  unsigned char ADC12MCTL6;   /* ADC12 Memory Control 6  */

  struct
  {
    unsigned char INCH0           : 1; /* ADC12 Input Channel Select Bit 0  */
    unsigned char INCH1           : 1; /* ADC12 Input Channel Select Bit 1  */
    unsigned char INCH2           : 1; /* ADC12 Input Channel Select Bit 2  */
    unsigned char INCH3           : 1; /* ADC12 Input Channel Select Bit 3  */
    unsigned char SREF0           : 1; /* ADC12 Select Reference Bit 0  */
    unsigned char SREF1           : 1; /* ADC12 Select Reference Bit 1  */
    unsigned char SREF2           : 1; /* ADC12 Select Reference Bit 2  */
    unsigned char EOS             : 1; /* ADC12 End of Sequence  */
  }ADC12MCTL6_bit;
} @ 0x0086;


/*
enum {
  INCH0           = 0x0001,
  INCH1           = 0x0002,
  INCH2           = 0x0004,
  INCH3           = 0x0008,
  SREF0           = 0x0010,
  SREF1           = 0x0020,
  SREF2           = 0x0040,
  EOS             = 0x0080,
};

*/

__no_init volatile union
{
  unsigned char ADC12MCTL7;   /* ADC12 Memory Control 7  */

  struct
  {
    unsigned char INCH0           : 1; /* ADC12 Input Channel Select Bit 0  */
    unsigned char INCH1           : 1; /* ADC12 Input Channel Select Bit 1  */
    unsigned char INCH2           : 1; /* ADC12 Input Channel Select Bit 2  */
    unsigned char INCH3           : 1; /* ADC12 Input Channel Select Bit 3  */
    unsigned char SREF0           : 1; /* ADC12 Select Reference Bit 0  */
    unsigned char SREF1           : 1; /* ADC12 Select Reference Bit 1  */
    unsigned char SREF2           : 1; /* ADC12 Select Reference Bit 2  */
    unsigned char EOS             : 1; /* ADC12 End of Sequence  */
  }ADC12MCTL7_bit;
} @ 0x0087;


