hjgqx996/GdkyWork/GSWCJ2019/sources/bsp/msp430x44x/io430f448.h
/*
enum {
  INCH0           = 0x0001,
  INCH1           = 0x0002,
  INCH2           = 0x0004,
  INCH3           = 0x0008,
  SREF0           = 0x0010,
  SREF1           = 0x0020,
  SREF2           = 0x0040,
  EOS             = 0x0080,
};

*/

__no_init volatile union
{
  unsigned char ADC12MCTL8;   /* ADC12 Memory Control 8  */

  struct
  {
    unsigned char INCH0           : 1; /* ADC12 Input Channel Select Bit 0  */
    unsigned char INCH1           : 1; /* ADC12 Input Channel Select Bit 1  */
    unsigned char INCH2           : 1; /* ADC12 Input Channel Select Bit 2  */
    unsigned char INCH3           : 1; /* ADC12 Input Channel Select Bit 3  */
    unsigned char SREF0           : 1; /* ADC12 Select Reference Bit 0  */
    unsigned char SREF1           : 1; /* ADC12 Select Reference Bit 1  */
    unsigned char SREF2           : 1; /* ADC12 Select Reference Bit 2  */
    unsigned char EOS             : 1; /* ADC12 End of Sequence  */
  }ADC12MCTL8_bit;
} @ 0x0088;


/*
enum {
  INCH0           = 0x0001,
  INCH1           = 0x0002,
  INCH2           = 0x0004,
  INCH3           = 0x0008,
  SREF0           = 0x0010,
  SREF1           = 0x0020,
  SREF2           = 0x0040,
  EOS             = 0x0080,
};

*/

__no_init volatile union
{
  unsigned char ADC12MCTL9;   /* ADC12 Memory Control 9  */

  struct
  {
    unsigned char INCH0           : 1; /* ADC12 Input Channel Select Bit 0  */
    unsigned char INCH1           : 1; /* ADC12 Input Channel Select Bit 1  */
    unsigned char INCH2           : 1; /* ADC12 Input Channel Select Bit 2  */
    unsigned char INCH3           : 1; /* ADC12 Input Channel Select Bit 3  */
    unsigned char SREF0           : 1; /* ADC12 Select Reference Bit 0  */
    unsigned char SREF1           : 1; /* ADC12 Select Reference Bit 1  */
    unsigned char SREF2           : 1; /* ADC12 Select Reference Bit 2  */
    unsigned char EOS             : 1; /* ADC12 End of Sequence  */
  }ADC12MCTL9_bit;
} @ 0x0089;


/*
enum {
  INCH0           = 0x0001,
  INCH1           = 0x0002,
  INCH2           = 0x0004,
  INCH3           = 0x0008,
  SREF0           = 0x0010,
  SREF1           = 0x0020,
  SREF2           = 0x0040,
  EOS             = 0x0080,
};

*/

__no_init volatile union
{
  unsigned char ADC12MCTL10;   /* ADC12 Memory Control 10  */

  struct
  {
    unsigned char INCH0           : 1; /* ADC12 Input Channel Select Bit 0  */
    unsigned char INCH1           : 1; /* ADC12 Input Channel Select Bit 1  */
    unsigned char INCH2           : 1; /* ADC12 Input Channel Select Bit 2  */
    unsigned char INCH3           : 1; /* ADC12 Input Channel Select Bit 3  */
    unsigned char SREF0           : 1; /* ADC12 Select Reference Bit 0  */
    unsigned char SREF1           : 1; /* ADC12 Select Reference Bit 1  */
    unsigned char SREF2           : 1; /* ADC12 Select Reference Bit 2  */
    unsigned char EOS             : 1; /* ADC12 End of Sequence  */
  }ADC12MCTL10_bit;
} @ 0x008A;


/*
enum {
  INCH0           = 0x0001,
  INCH1           = 0x0002,
  INCH2           = 0x0004,
  INCH3           = 0x0008,
  SREF0           = 0x0010,
  SREF1           = 0x0020,
  SREF2           = 0x0040,
  EOS             = 0x0080,
};

*/

__no_init volatile union
{
  unsigned char ADC12MCTL11;   /* ADC12 Memory Control 11  */

  struct
  {
    unsigned char INCH0           : 1; /* ADC12 Input Channel Select Bit 0  */
    unsigned char INCH1           : 1; /* ADC12 Input Channel Select Bit 1  */
    unsigned char INCH2           : 1; /* ADC12 Input Channel Select Bit 2  */
    unsigned char INCH3           : 1; /* ADC12 Input Channel Select Bit 3  */
    unsigned char SREF0           : 1; /* ADC12 Select Reference Bit 0  */
    unsigned char SREF1           : 1; /* ADC12 Select Reference Bit 1  */
    unsigned char SREF2           : 1; /* ADC12 Select Reference Bit 2  */
    unsigned char EOS             : 1; /* ADC12 End of Sequence  */
  }ADC12MCTL11_bit;
} @ 0x008B;


/*
enum {
  INCH0           = 0x0001,
  INCH1           = 0x0002,
  INCH2           = 0x0004,
  INCH3           = 0x0008,
  SREF0           = 0x0010,
  SREF1           = 0x0020,
  SREF2           = 0x0040,
  EOS             = 0x0080,
};

*/

__no_init volatile union
{
  unsigned char ADC12MCTL12;   /* ADC12 Memory Control 12  */

  struct
  {
    unsigned char INCH0           : 1; /* ADC12 Input Channel Select Bit 0  */
    unsigned char INCH1           : 1; /* ADC12 Input Channel Select Bit 1  */
    unsigned char INCH2           : 1; /* ADC12 Input Channel Select Bit 2  */
    unsigned char INCH3           : 1; /* ADC12 Input Channel Select Bit 3  */
    unsigned char SREF0           : 1; /* ADC12 Select Reference Bit 0  */
    unsigned char SREF1           : 1; /* ADC12 Select Reference Bit 1  */
    unsigned char SREF2           : 1; /* ADC12 Select Reference Bit 2  */
    unsigned char EOS             : 1; /* ADC12 End of Sequence  */
  }ADC12MCTL12_bit;
} @ 0x008C;


/*
enum {
  INCH0           = 0x0001,
  INCH1           = 0x0002,
  INCH2           = 0x0004,
  INCH3           = 0x0008,
  SREF0           = 0x0010,
  SREF1           = 0x0020,
  SREF2           = 0x0040,
  EOS             = 0x0080,
};

*/

__no_init volatile union
{
  unsigned char ADC12MCTL13;   /* ADC12 Memory Control 13  */

  struct
  {
    unsigned char INCH0           : 1; /* ADC12 Input Channel Select Bit 0  */
    unsigned char INCH1           : 1; /* ADC12 Input Channel Select Bit 1  */
    unsigned char INCH2           : 1; /* ADC12 Input Channel Select Bit 2  */
    unsigned char INCH3           : 1; /* ADC12 Input Channel Select Bit 3  */
    unsigned char SREF0           : 1; /* ADC12 Select Reference Bit 0  */
    unsigned char SREF1           : 1; /* ADC12 Select Reference Bit 1  */
    unsigned char SREF2           : 1; /* ADC12 Select Reference Bit 2  */
    unsigned char EOS             : 1; /* ADC12 End of Sequence  */
  }ADC12MCTL13_bit;
} @ 0x008D;


/*
enum {
  INCH0           = 0x0001,
  INCH1           = 0x0002,
  INCH2           = 0x0004,
  INCH3           = 0x0008,
  SREF0           = 0x0010,
  SREF1           = 0x0020,
  SREF2           = 0x0040,
  EOS             = 0x0080,
};

*/

